import { ITask } from '../types/task'

export const todoDataTasks: ITask[] = [
  {
    'id': '1',
    'title': 'Підготовка до презентації',
    'description':
      'Розробити слайди та підготувати виступ для завтрашньої презентації.',
    'isCompleted': true,
  },
  {
    'id': '2',
    'title': 'Вивчення нового фреймворку',
    'description':
      'Дослідження та вивчення можливостей нового фреймворку для проекту.',
    'isCompleted': false,
  },
  {
    'id': '3',
    'title': 'Оптимізація бази даних',
    'description': 'Виконати оптимізацію запитів .',
    'isCompleted': true,
  },

  {
    'id': '4',
    'title': 'Розробка нового функціоналу',
    'description': 'Написання коду для нового функціоналу.',
    'isCompleted': false,
  },
  {
    'id': '5',
    'title': 'Підготовка до презентації',
    'description':
      'Розробити слайди та підготувати виступ для завтрашньої презентації.',
    'isCompleted': true,
  },
  {
    'id': '6',
    'title': 'Вивчення нового фреймворку',
    'description':
      'Дослідження та вивчення можливостей нового фреймворку для проекту.',
    'isCompleted': false,
  },
  {
    'id': '7',
    'title': 'Оптимізація бази даних',
    'description': 'Виконати оптимізацію запитів та структури бази даних .',
    'isCompleted': true,
  },

  {
    'id': '8',
    'title': 'Розробка нового функціоналу',
    'description': 'Написання коду для нового функціоналу.',
    'isCompleted': false,
  },
]
